## <center>DATA CLEANING</center>

In [28]:
import numpy as np
import pandas as pd

In [29]:
btc_eth = pd.read_csv('../data/btc-eth-prices.csv', parse_dates = True, index_col= [0])

#prices_dataframe = pd.DataFrame(index =)

In [30]:
Timeseries = pd.Series(btc_eth.index)
Timeseries.info()
Timeseries.head()

<class 'pandas.core.series.Series'>
RangeIndex: 365 entries, 0 to 364
Series name: Timestamp
Non-Null Count  Dtype
--------------  -----
365 non-null    datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 3.0 KB

0   2017-04-02
1   2017-04-03
2   2017-04-04
3   2017-04-05
4   2017-04-06
Name: Timestamp, dtype: datetime64[ns]

In [31]:
btc_eth.iloc[:3, :2]

                Bitcoin  Ether
Timestamp
2017-04-02  1099.169125  48.55
2017-04-03  1141.813000  44.13
2017-04-04  1141.600363  44.43

In [32]:
rng = np.random.default_rng(seed = 42)
index = [
    ('California', 2010),
    ('California', 2020),
    ('Florida', 2010),
    ('Florida', 2020),
    ('New York', 2010),
    ('New York', 2020),
    ('Chicago', 2010),
    ('Chicago', 2020)
]
population = rng.integers(size = 8, low =90000000 , high = 100000000)

In [33]:
u_18 = np.array((population*0.2), dtype = int)
u_18

array([18178501, 19547912, 19309143, 18877756, 18866030, 19717195,
       18171891, 19394736])

In [34]:
census = pd.DataFrame(population, index= index, columns=['Population']) 
# index = pd.MultiIndex.from_tuples(index)
# census = pd.DataFrame({'Population':population, 'U_18':u_18}, index= index)

In [35]:
index = pd.MultiIndex.from_product([
    [2013, 2014], 
    [1, 2]],
    names=['year', 'visit'])

columns = pd.MultiIndex.from_product([
    ['Bob', 'Guido', 'Sue'], 
    ['HR', 'Temp']],
    names=['subject', 'type'])

In [36]:
data = np.random.randn(4, 6)
data[:, ::2] *= 10
data += 37
data = np.round(data, 1)
data

array([[47.6, 34.6, 41. , 37.4, 48.1, 38.1],
       [44.3, 36.8, 34.5, 35.6, 37.1, 37.2],
       [28.9, 35.4, 36.5, 36.2, 45.8, 37.6],
       [30.1, 36. , 24.1, 38.7, 27.2, 37.3]])

In [37]:
health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.6  34.6  41.0  37.4  48.1  38.1
     2      44.3  36.8  34.5  35.6  37.1  37.2
2014 1      28.9  35.4  36.5  36.2  45.8  37.6
     2      30.1  36.0  24.1  38.7  27.2  37.3

In [38]:
health_data.loc[:, ('Guido', 'HR')]

year  visit
2013  1        41.0
      2        34.5
2014  1        36.5
      2        24.1
Name: (Guido, HR), dtype: float64

In [39]:
!pwd

/mnt/sdcard/WORK/Data_Analysis/notebooks

In [40]:
# Following are commands to download the data
repo = "https://raw.githubusercontent.com/jakevdp/data-USstates/master"
!cd /mnt/sdcard/WORK/Data_Analysis/data && curl -O {repo}/state-population.csv
!cd /mnt/sdcard/WORK/Data_Analysis/data && curl -O {repo}/state-areas.csv
!cd /mnt/sdcard/WORK/Data_Analysis/data && curl -O {repo}/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0curl: (6) Could not resolve host: raw.githubusercontent.com
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0curl: (6) Could not resolve host: raw.githubusercontent.com
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0curl: (6) Could not resolve host: raw.githubusercontent.com

In [41]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
    for c in cols}
    return pd.DataFrame(data, ind)

In [42]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}{1}
    """
    def __init__(self, *args):
        self.args = args

    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [43]:
population = pd.read_csv('/mnt/sdcard/WORK/Data_Analysis/data/state-population.csv')
areas = pd.read_csv('/mnt/sdcard/WORK/Data_Analysis/data/state-areas.csv')
abbrevs = pd.read_csv('/mnt/sdcard/WORK/Data_Analysis/data/state-abbrevs.csv')
display('population.head()', 'areas.head()', 'abbrevs.head()')

population.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [44]:
merged = pd.merge(population, abbrevs, how = 'outer', left_on = 'state/region', right_on='abbreviation')
merged.head()

  state/region     ages  year  population   state abbreviation
0           AK    total  1990    553290.0  Alaska           AK
1           AK  under18  1990    177502.0  Alaska           AK
2           AK    total  1992    588736.0  Alaska           AK
3           AK  under18  1991    182180.0  Alaska           AK
4           AK  under18  1992    184878.0  Alaska           AK

In [45]:
merged = merged.drop('abbreviation', axis = 1)

In [50]:
merged.loc[merged['state'].isnull(), 'state/region'].unique() 
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'

In [51]:
final = pd.merge(merged, areas, on = 'state', how = 'left')
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [70]:
i = final.isnull().any(axis=1).index
i

RangeIndex(start=0, stop=2544, step=1)